Show / Hide Table of Contents
Class ConnHiddenClientFactory
Inheritance
System.Object
ConnHiddenClientFactory
Implements
System.IDisposable
IConnCalculatorFactory
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public class ConnHiddenClientFactory : IDisposable, IConnCalculatorFactory
Constructors
Improve this Doc   View Source
ConnHiddenClientFactory(String)
Declaration
public ConnHiddenClientFactory(string ideaInstallDir)
Parameters
 Type |  Name |  Description
 System.String |  ideaInstallDir
Methods
Improve this Doc   View Source
Create()
Declaration
public ConnectionHiddenCheckClient Create()
Returns
 Type |  Description
 ConnectionHiddenCheckClient
Improve this Doc   View Source
Dispose()
Declaration
public void Dispose()
Improve this Doc   View Source
Dispose(Boolean)
Declaration
protected virtual void Dispose(bool disposing)
Parameters
 Type |  Name |  Description
 System.Boolean |  disposing
Implements
 System.IDisposable
 IConnCalculatorFactory
 Improve this Doc
 View Source